UA/app/Models/ExchangeHistoryModel.php

UPDATE `exchange_history` SET `processed_by` = '5', `status` = 'Claimed', `updated_at` = '2024-06-29-01:48:42pm'
WHERE `exchange_history`.`exchange_id` IN ('3')
---
    public function UpdateRecords($id,$data)
    {
        return $this->update($id,$data);

SELECT `ex`.`points_used`, `ex`.`voucher`, `ex`.`status`, `ex`.`created_at`, `r`.`rewards_name`
FROM `exchange_history` as `ex`
LEFT JOIN `rewards` as `r` ON `ex`.`rewards_id` = `r`.`rewards_id`
WHERE `ex`.`person_id` = ('6')
ORDER BY `ex`.`created_at` DESC
---
    public function GetAllRecordsbyUser($PersonID)
    {
        $db = \Config\Database::connect();
        $builder = $db->table('exchange_history as ex');
        $builder->select('ex.points_used, ex.voucher, ex.status, ex.created_at, r.rewards_name');
        $builder->join('rewards as r', 'ex.rewards_id = r.rewards_id', 'left');
        $builder->where('ex.person_id', $PersonID);
        $builder->orderBy('ex.created_at', 'DESC'); // Order by created_at in descending order

        $query = $builder->get();

SELECT `ex`.`points_used`, `ex`.`voucher`, `ex`.`status`, `ex`.`created_at`, `r`.`rewards_name`, `p`.`fname`, `p`.`lname`, `p`.`mname`, CONCAT(ua.fname, " ", ua.lname) as admin
FROM `exchange_history` as `ex`
LEFT JOIN `rewards` as `r` ON `ex`.`rewards_id` = `r`.`rewards_id`
LEFT JOIN `persons` as `p` ON `ex`.`person_id` = `p`.`person_id`
LEFT JOIN `users_account` as `ua` ON `ex`.`processed_by` = `ua`.`user_id`
ORDER BY `ex`.`created_at` DESC
---
    public function GetAllRecords()
    {
        $db = \Config\Database::connect();
        $builder = $db->table('exchange_history as ex');
        $builder->select('ex.points_used, ex.voucher, ex.status, ex.created_at, r.rewards_name, p.fname, p.lname, p.mname, CONCAT(ua.fname, " ", ua.lname) as admin');
        $builder->join('rewards as r', 'ex.rewards_id = r.rewards_id', 'left');
        $builder->join('persons as p', 'ex.person_id = p.person_id', 'left');
        $builder->join('users_account as ua', 'ex.processed_by = ua.user_id', 'left');
        $builder->orderBy('ex.created_at', 'DESC');

        $query = $builder->get();

SELECT `ex`.`exchange_id`, `ex`.`points_used`, `ex`.`voucher`, `ex`.`status`, `ex`.`created_at`, `r`.`rewards_name`, `r`.`rewards_description`, `r`.`rewards_image`, `p`.`fname`, `p`.`lname`, `p`.`mname`
FROM `exchange_history` as `ex`
LEFT JOIN `rewards` as `r` ON `ex`.`rewards_id` = `r`.`rewards_id`
LEFT JOIN `persons` as `p` ON `ex`.`person_id` = `p`.`person_id`
WHERE `ex`.`voucher` = '1BwDApb2'
AND `ex`.`status` = 'Pending'
---
    public function GetRecordsbyVoucher($voucher)
    {
        $db = \Config\Database::connect();
        $builder = $db->table('exchange_history as ex');
        $builder->select('ex.exchange_id,ex.points_used, ex.voucher, ex.status, ex.created_at, r.rewards_name, r.rewards_description,r.rewards_image,p.fname, p.lname, p.mname');
        $builder->join('rewards as r', 'ex.rewards_id = r.rewards_id', 'left');
        $builder->join('persons as p', 'ex.person_id = p.person_id', 'left');
        $builder->where('ex.voucher', $voucher);
        $builder->where('ex.status', "Pending");
        $query = $builder->get();