UA/app/Models/PersonsModel.php

    public function GetRecordsbyId($id)
    {
        return $this->where('person_id',$id)->first();
---
SELECT *
FROM `persons`
WHERE `person_id` = ('6')
AND `persons`.`deleted_at` IS NULL
 LIMIT 1