UA/app/Models/RewardsModel.php

SELECT *
FROM `rewards`
---
    public function GetAllRecords()
    {
        return $this->findAll();