UA/app/Models/UsersAccountModel.php

SELECT `person_id`
FROM `users_account`
WHERE `user_id` = '6'
 LIMIT 1
---
    public function GetPersonIDbyUserID($user_id)
    {
        return $this->select('person_id')->where('user_id',$user_id)->first();

SELECT *
FROM `users_account`
WHERE `role` != 0
---
    public function GetAllAdminRecords()
    {
        return $this->where('role !=',0 )->findAll();